In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Grade': ['A', 'B', 'A']
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df.to_csv("students.csv", index=False)

In [6]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Grade': ['A', 'B', 'A'],
    'City':["New York", "Los Angeles", "Chicago"]
}

In [7]:
df = pd.DataFrame(data)

In [8]:
df.to_csv("updated_student.csv", index=False)

In [9]:
data = {
    'Product': ['Apple', 'Banana', 'Orange'],
    'Price': [1.2, 0.8, 1.0]
}

In [10]:
df = pd.DataFrame(data)

In [11]:
df.to_excel("products.xlsx", index=False)

In [12]:
data = {
    'Product': ['Apple', 'Banana', 'Orange'],
    'Price': [1.2, 0.8, 1.0],
   'Quantity':[10,20,50]
}

In [13]:
df = pd.DataFrame(data)

In [14]:
df.to_excel("updated_products.xlsx", index=False)

In [15]:
data = {
    'Name': ["Alice","Bob","charlie"],
    'Age':[25,30,35],
    'City':["New york","Los Angles","Chicago"]
}

In [16]:
df = pd.DataFrame(data)

In [17]:
df[df['Age']>30]

      Name  Age     City
2  charlie   35  Chicago

In [18]:
df=df.rename(columns={'City': "Location"})
df

      Name  Age    Location
0    Alice   25    New york
1      Bob   30  Los Angles
2  charlie   35     Chicago

In [19]:
df['Location'].replace("New york","NY")

0            NY
1    Los Angles
2       Chicago
Name: Location, dtype: object

In [24]:
data = {'Name': ["Alice", "Bob", "Charlie"],
        'Age': [25, 30, None],
        'Salary': [50000, None, 70000]}

df = pd.DataFrame(data)
df

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0      NaN
2  Charlie   NaN  70000.0

In [32]:
# df['Age'] = pd.to_numeric(df['Age'].replace('None', np.nan))
df['Age'].fillna(df['Age'].mean())

0    25.0
1    30.0
2    27.5
Name: Age, dtype: float64

In [ ]:
df['Salary'] = pd.to_numeric(df['Salary'].replace('None', 0))

df = df.dropna(how='all')

In [ ]:
df

In [ ]:
data = {
    'Name':["Alice","Bob"],
    'Age':[25,30]
}

In [ ]:
df1 = pd.DataFrame(data)

In [ ]:
df1.to_csv("employees1.csv", index=False)

In [ ]:
data = {
    'Name':["Charlie","David"],
    'Age':[35,40]
}

In [ ]:
df2 = pd.DataFrame(data)

In [ ]:
df2.to_csv("employees2.csv", index=False)

In [ ]:
df1 = pd.read_csv("employees1.csv")
df2 = pd.read_csv("employees2.csv")

In [ ]:
combined_df = pd.concat([df1, df2], ignore_index=True)

In [ ]:
combined_df